cases/Chapter_7/turbine_only/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../myVars" //Include global variables

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         320;

deltaT          $dt0;

writeControl    runTime;

writeInterval   16;

writeFormat     binary;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable true;

adjustTimeStep  false;

libs
(
    "libfloatingTurbinesFoam.so"
);

DebugSwitches
{
	actuatorLineElement 0;
}

functions
{
    #include "sampling" //Include sampling definition
}

// ************************************************************************* //
