cases/Chapter_7/turbine_only/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             Euler;
}

gradSchemes
{
    default cellLimited Gauss linear 1.0;
}

divSchemes
{
    div(phi,U)   Gauss limitedLinearV 1;
    div(phi,k)      bounded Gauss linearUpwind grad(k);
    div(phi,omega)  bounded Gauss linearUpwind grad(omega);
    div((nuEff*dev(T(grad(U)))))    Gauss linear;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             corrected;
}

fluxRequired
{
    default             no;
    p;
    pcorr;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
